{
    "en": {
        "Recent": "Recent",
        "Help": "Help",
        "Q&A": "Q&A",
        "For more": "For more information about how Hats++ works, visit this page: ",
        "Home": "Home",
        "Welcome": "Welcome to HatsPlusPlus Editor app!",
        "This app": "This app is designed to create hats for the ",
        "HatsPlusPlus": "HatsPlusPlus",
        "With this 1": "With this mod you can make animated hats, and also additional elements, such as pets, wings, ",
        "Rooms": "rooms.",
        "With this 2": "The resulting hat will be visible to everybody in a lobby, no matter if they have the mod or not. Isn't that cool?😎",
        "mod": " mod.",
        "To start": "To start editing, open an existing hat via Hat -> ",
        "Open": "Open",
        "or create": ", or create a new one via Hat -> ",
        "New": "New.",
        "Enjoy": "Enjoy",
        "I love you": "I love you",
        "By the way": "By the way, feel free to ",
        "hower": "hower your cursor",
        "Now thats": "Now that's the spirit! Keep going, and you shall become a true hat wizard.",
        "over something": " over something you don't understand! There are plenty of tooltips explaining everything with a bit more detail.",
        "Oh, and": "Oh, and if you want to edit some sprites and see the resulting animation, you don't have to restart the whole app! Images will be reloaded automatically after they are saved <3\nIf you have discovered a bug or have other problems, send me a message in discord, the nick is polanas.",
        "New1": "New",
        "Open1": "Open",
        "Save": "Save",
        "Save as": "Save as",
        "Elements": "Elements",
        "Add": "Add",
        "Select": "Select",
        "Wearable": "Wereable",
        "Wings": "Wings",
        "Extra": "Extra",
        "Room": "Room",
        "Flying pet": "Flying pet",
        "Walking pet": "Walking pet",
        "Preview": "Preview",
        "Settings": "Settings",
        "Theme": "Theme",
        "Language": "Language",
        "Russian": "Russian",
        "English": "English",
        "Other": "Other",
        "Hat": "Hat",
        "Open Home": "Open home tab",
        "Open Help": "Open Q&A tab",
        "Q1": "How does extra hat actually work?",
        "A1": "Extra hat consists of elements of a regular vanilla hat (rock, cape, metapixels, particles), that will be applied to every frame of a wereable hat. It's useful because it would be tedious to copy it to every frame of your wereable hat just to have some particles, so the mod does it for you instead. Ok, here is an example. That's how extra hat may look like: ",
        "A1_2": "Imagine this is a frame of the wereable hat:",
        "A1_3": "Then, this is what the resulting frame will look like. This is done for every frame.",
        "A1_4": "If you want different frames to have different extra hats, just put more of them! That way, each wereable hat frame will get corresponding extra hat frame. So, if that's our wereable hat:",
        "A1_5": "And that's our extra hat:",
        "A1_6": "The result will be: ",
        "1": "Ok, expalin all the hat elements in more detail",
        "2": "Here you go!",
        "3": "Wearable hat is the one that your duck will wear. As for now, the individual frame size of this element is 32 by 32 pixels only, due to some technical reasons (also I'm lazy). Also, this element is required, otherwise your hat won't load. Example: ",
        "4": "Hat elements?",
        "5": "Now, bear with me. When I say 'hat' in Hats++ context, what I mean is not just a regular vanilla hat you can wear, but a combination of hat elements. Here is the list of all avalible hat elements at the moment: ",
        "6": "A preview hat is a 32 by 32 pixels image that will be added to hat selector in-game, so that you can locate your hat. Without this element present, your hat won't be loaded. Here is how one might look like:",
        "7": "Pets",
        "8": "Flying and walking pets are little fellas that follow you around. You can guess what each one does by its name. Note that, as of now, walking pets are quite broken; flying ones are more stable. Also note that unlike wereable hats, pets' frame sizes range from 32x32 up to 64x64. Go crazy with them!\nA walking pet example: ",
        "8.1": "And a flying pet:",
        "9": "Ahh, wings... Terraria wibes. Although it makes little sence to add another pair of wings to a duck, here we are! Wings are basically sprites locked behind the duck, with some auto generated animations to make it look nice. Here is something important: it's assumed that the first frame is when the wings are fully closed, and the last - you guessed it - when they are fully open.",
        "10": "How do I animate stuff?",
        "11": "The first thing you will need to make is a sprite sheet - it's an image containing all the individual frames that will be used in your animations. One important detail is that they have to be contiguous: i.e. frames should be stacked together in a grid with no gaps, or else when animating the frames won't allign properly. You can place them vertically, diagonally, or both. Frames are read from left to right, from top to bottom.\nHere is how a sprite sheet might look like: ",
        "12": "Before we begin",
        "13": "Animations",
        "14": "An animation is a series of frames. That's it. It also has a delay between frames (1 delay unit = 1/60 seconds) and a type. Animation's type determins when it's gonna be played. 'On Press Quack' animation will play *every* time your duck quacks.Note that as soon as a condition is met for which an animation exists, current animation will be overwritten to that new animation. For example, An animation can also be looped, making in play indefinetely until any other animation is triggered, or not, in which case will play only once and stop at the last frame.\nNote: an animation can contain an arbitrary amount of frames (they can also be used multiple times in a single animation). Mutiple animations can use the same frames. Think of animations as a series of integer values describing what frames will be played. Later this values are used to index the frames themselves.",
        "15": "How do I use a Hats++ hat?",
        "16": "When a hat is saved, a folder containing all the elements is generated (WARNING: do not store anthing important in these folders. Each time a hat is saved, they will be cleared, deleting everthing inside). Be careful when tweaking the images after saving: don't rename the elements or change pixels on the right side (those contain the information about the animations and other parameters). To use the hat, just put it in the hats folder, located at %PATH_TO_YOUR_SAVE%/Custom/Hats",
        "17": "Cool! But I don't quite get the 'Quack Link Frame State' thing.",
        "18": "Well, to create linked animation y",
        "19": "In this hat, the quack state is set to saved, which will just not reset the frame count when switching between these animations. Here is how it looks like in action: TODO",
        "20": "Onto the second usage! Here's a hat:",
        "21": "On press quack containts the frames 1 to 8, and on release quack is the reverse: it's from 8 to 1. While you hold quack, the chest opening animation will play, but when you release the button, it's gonna play the release animation, but starting from the last played frame. Better see it for yourself: TODO",
        "22": "And that's it! Phew.",
        "23": "Preview hat",
        "24": "Set texture",
        "25": "Remove element"
    },
    "ru": {
        "Welcome": "Добро пожаловать в редактор Hats++ шапок!",
        "Help": "Помощь",
        "Q&A": "Вопросы и ответы",
        "For more": "Дополнительная инфнормация о Hats++ находится здесь: ",
        "This app": "Этa программа предназначена для создания шапок для модa ",
        "HatsPlusPlus": "Hats++",
        "With this 1": "Этот мод позволяет создавать анимированные шапки, а также питомцев, крылья, ",
        "Rooms": "комнаты.",
        "With this 2": "Шапка будет видна всем игрокам в лобби независимо от того, стоит ли у них мод. Круто, да?😎",
        "mod": "",
        "To start": "Чтобы начать создавать шапку, откройте уже существующую с помощью Шапка -> ",
        "Open": "Открыть",
        "or create": ", или создайте новую с помощью Шапка -> ",
        "New": "Новая.",
        "Enjoy": "Наслаждайтесь",
        "I love you": "Я люблю тебя",
        "By the way": "Кстати, не стесняйтесь ",
        "hower": "наводить курсор на ",
        "Now thats": "Так держать! Продолжайте в том же духе, и вы обязательно станете шапочным мастером.",
        "over something": "что-то непонятное. Скорее всего, появится подсказка:).",
        "Oh, and": "Да, и если вы захотите поменять пнгшку шапки и посмотреть, как изменится анимация, совсем необязательно перезапускать приложение! Всё обновится автоматически после сохранения изображения <3\nЕсли вы нашли баг или возникли иные проблемы, ищите меня в дискорде по нику polanas.",
        "New1": "Новая",
        "Open1": "Открыть",
        "Save": "Сохранить",
        "Save as": "Сохранить как",
        "Elements": "Элементы",
        "Add": "Добавить",
        "Select": "Выбрать",
        "Wearable": "Стандартная шапка",
        "Wings": "Крылья",
        "Extra": "Дополнительная шапка",
        "Room": "Комната",
        "Flying pet": "Летающий питомец",
        "Walking pet": "Ходячий питомец",
        "Preview": "Превью",
        "Settings": "Настройки",
        "Theme": "Тема",
        "Language": "Язык",
        "Russian": "Русский",
        "English": "Английский",
        "Other": "Другое",
        "Hat": "Шапка",
        "Home": "Домашняя страница",
        "Open Home": "Открыть домашнюю страницу",
        "Open Help": "Открыть страницу вопрсов и ответов",
        "Recent": "Недавние",
        "Q1": "Что именно делает дополнительная шапка?",
        "A1": "Дополнительная шапка - это элементы из обычной ванильной шапки (камень, плащ, метапиксели, частицы), которые будут применяться для каждого кадра стандартной шапки. Это полезно, так как иначе пришлось бы вручную добавлять к каждому кадру шапки камень, частицы, метапиксели и т.д., так что мод делает это сам. Например, если у нас вот такая дополнительная шапка...",
        "A1_2": "А это - стандартная шапка...",
        "A1_3": "То в результате получится вот такой кадр. Это происходит с каждом кадром стандартной шапки.",
        "A1_4": "Если вы хотите, чтобы у разных кадров стандартной шапки были разные кадры дополнительной шапки, то просто добавьте больше кадров! При такой стандартной шапке...",
        "A1_5": "И такой доп. шапке...",
        "A1_6": "Резултат будет таким:",
        "1": "За что именно отвечает каждый элемент шапки?",
        "2": "Ну, поехали!",
        "3": "Стандартная шапка - это та, которую носит утка. На данный момент кадр такой шапки может быть только 32 на 32 пикселя из-за определенных технических тонокстей (ну и еще из-за моей лени). Кстати, без нее шапка тоже не загрузится. Вот пример",
        "4": "Элементы шапки?",
        "5": "Сейчас все объясню. Под шапкой в контексте Hats++ я подразумеваю не ванильную шапку, которую носит утка, а комбинацию шапочных элементов. Вот их список:",
        "6": "Превью - это шапка размером 32 на 32 пикселя, которая появится в окне выборе шапок в игре. Без этого элемента шапка не загрузится. Вот, как может выглядеть превью:",
        "7": "Питомцы",
        "8": "Летающие и ходячие питомцы - это челики, которые преследуют вас по пятам. По названию понятно, что именно делает каждый из них. На данный момент ходячие питомцы немного... сломаны; летающие более стабильны.\nВ отличие от стандартной шапки, размер кадра питомцев может достигать 64 на 64! Делайте с этим то, что считаете нужным :). Пример ходячего питомца",
        "8.1": "И летающего:",
        "9": "Охх, крылья... Да, добавлять еще одну пару крыльев утке мягко говоря странно, но меня это не остановило. И так, крылья располагаются за уткой. Для них автоматически генерируются все нужные анимации. Важный момент: предполагается, в первом кадре крылья полностью закрыты, а в последнем - наоборот, раскрыты.",
        "10": "А как работают анимации?",
        "11": "Первое, что вам потребуется - спрайт лист - изображение, содержащее все кадры вашей шапки. Убедитесь, что между кадры плотно упакованы друг за другом, иначе все может съехать. Кадры можно расположить вертикально, горизонтально, или и то и то вместе. Имейте в виду, что кадры читаются слева направо, сверху вниз.\nВот, как может выглядеть спрайт лист:",
        "12": "Но сперва...",
        "13": "Анимации",
        "14": "Анимация - это набор кадров. Вот так просто. У нее также есть задержка между кадрами (1 единица задержки = 1/60 секунды), а также тип, определяющий, при каком условии она будет проигрываться. При этом, при соблюдении любого условия текущая анимация перезаписывается на ту, условия которой были соблюдены. Например, анимация 'На нажатие кряка' начнет проигрываться, когда вы нажмете кнопку кряка. Анимация может быть зациклена - тогда она будет играть, пока другая анимация не займет ее место, или нет - тогда она просто остановится на последнем кадре.\nАнимации могут содержать любое количество кадров, а сами кадры могут повторяться. Для лучшего понимания думайте об анимациях, как о последовательности чисел, определяющих, какие кадр будут проигрываться.",
        "15": "Как использовать Hats++ шапки?",
        "16": "При сохранении шапки создается папка со всеми элементами (ВНИМАНИЕ: не следует хранить ничего важного в папках с элементами. При сохранении папки будут предварительно очищены). Будьте осторожны при редактировании элементов после сохранения: не меняйте названия файлов или значения пикселей, расположенных справа от спрайт листа (они содержат информацию об анимациях и других параметров). Чтобы добавить шапку в игру, перетащите ее в вашу папку с шапками, расположенную по пути %ПУТЬ_ДО_СОХРАНЕНИЯ%/Cusom/Hats",
        "17": "Класс! Но я не совсем понял, что такое 'Свзязь анимаций кряка'",
        "18": "Чтобы связать анимации кряка - нужно сначала их иметь, а именно: анимации 'При нажатии кряка' и 'При отпускании кряка'. Убедитесь, что у обоих анимаций одинаковое количество кадров, иначе они не будут отображаться корректно. Есть два типа связок: 'Сохранение кадра' и 'Реверсирование кадра'. Остановимся подробнее на первом из них.\nПредставьте, что вы делаете шапку с анимациями на нажатие и отжатие кряка. При этом, вам нужно, чтобы при смене одной анимации на другую сохранялся текущий кадр. В этом и заключается смысл 'Сохранения кадра'.\nНиже представлен интерактивный пример того, как это будет выглядеть в игре. Первая шапка не имеет связи, а вторая связана через сохранение кадра. Нажмите E, чтобы крякнуть. ",
        "21": "А что, если одна анимация как бы 'противоположна' другой? Тогда простое сохранение кадра приведет к неправильному результату! Для этого существует 'Реверсирование кадра'. Используйте этот режим, когда вам нужно, чтобы при нажатии на кряк анимация играла в одну сторону, а при отжатии - в другую. (При этом, необходимо, чтобы сами кадры этих анимаций были 'отзеркалены'. Например, от 1 до 8 и от 8 до 1. Далее еще один пример, в котором вторая шапка связана через реверсивный кадр.",
        "23": "Превью шапка",
        "24": "Установить текстуру",
        "25": "Удалить элемент"
    }
}
